MIT License

Copyright (c) [2024] [ByteBusters]

Разрешение предоставляется, бесплатно, всем желающим, на основе использования, копирования, изменения, слияния, публикации, распределения, суб-лицензирования и/или продажи копий данного программного обеспечения, и чтобы позволить этим лицам, которые получают программное обеспечение, сделать это, с условиями, что вышеупомянутые авторские права и это уведомление о лицензии будут включены в все копии или значимые части данного программного обеспечения.

Данный программный продукт предоставляется «как есть», без каких-либо гарантий, явных или подразумеваемых, включая, помимо прочего, гарантии товарности и пригодности для конкретной цели. В любом случае, авторы или правообладатели не несут ответственности за любой ущерб или убытки, будь то в результате действий контракта, деликта или иных юридических оснований, возникающие из, или в связи с использованием или другими действиями с данным программным обеспечением.
